In [4]:
#import all the required libraries
import pandas as pd

In [6]:
#import data sets
df_cust = pd.read_csv('..\Data\Customer.csv')

,month,credit_amount,credit_term,age,sex,education,product_type,having_children_flg,region,income,family_status,phone_operator,is_client,bad_client_target
0,1,7000,12,39,male,Secondary special education,Cell phones,0,2,21000,Another,0,0,0
1,1,19000,6,20,male,Secondary special education,Household appliances,1,2,17000,Another,3,1,0
2,1,29000,12,23,female,Secondary special education,Household appliances,0,2,31000,Another,2,0,0
3,1,10000,12,30,male,Secondary special education,Cell phones,1,2,31000,Unmarried,3,1,0
4,1,14500,12,25,female,Higher education,Cell phones,0,2,26000,Married,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1718,12,18500,6,32,male,Higher education,Cell phones,1,2,46000,Another,1,1,0
1719,12,6500,6,24,male,Secondary special education,Cell phones,0,2,18000,Another,0,1,0
1720,12,5500,12,21,male,Incomplete higher education,Cell phones,0,2,15000,Another,1,1,0
1721,12,30500,10,25,female,Incomplete higher education,Cell phones,0,2,41000,Another,2,1,1
1722,12,116000,24,34,male,Higher education,Clothing,1,2,41000,Another,2,0,0

### Let's find missing values

In [10]:
# missing values
missing_val = df_cust.isnull().sum()

print("Missings values\n",missing_val)

print("\nThere are no missing values in the data set")

Missings values
 month                  0
credit_amount          0
credit_term            0
age                    0
sex                    0
education              0
product_type           0
having_children_flg    0
region                 0
income                 0
family_status          0
phone_operator         0
is_client              0
bad_client_target      0
dtype: int64

There are no missing values in the data set

### Data Transformation

In [13]:
# lets find the data types of each column
# Get the data types of all columns
d_types = df_cust.dtypes
print(d_types)

month                   int64
credit_amount           int64
credit_term             int64
age                     int64
sex                    object
education              object
product_type           object
having_children_flg     int64
region                  int64
income                  int64
family_status          object
phone_operator          int64
is_client               int64
bad_client_target       int64
dtype: object